ERP.belugaerp/src/Documents/битОперацияУчетаАкциза/битОперацияУчетаАкциза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битОперацияУчетаАкциза</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностямВыпускПродукции</registerRecords>
  <registerRecords>AccumulationRegister.бг_АкцизПоПриобретеннымЦенностям</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.бг_ВидыОперацийУчетаАкцизов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АкцизПоПриобретеннымЦенностям</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Сделка</name>
      <type>
        <types>CatalogRef.бг_БанковскиеГарантии</types>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеСырья</name>
      <type>
        <types>EnumRef.бг_СостоянияПодакцизногоСырья</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкциза</name>
      <type>
        <types>EnumRef.бг_СостоянияОплатыВходящегоАкциза</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияПродукции</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеОплатыАванса</name>
      <type>
        <types>CatalogRef.бг_СостоянияОплатыАванса</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПодтверждениеЭкспорта</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/Enums/бг_СостоянияОплатыВходящегоАкциза/бг_СостоянияОплатыВходящегоАкциза.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияОплатыВходящегоАкциза</name>
  <enumValues>
    <name>АкцизПоВозвращеннойПродукции</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйАкцизВСырье</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйАкцизВСырьеВозвращенныйОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>АвансовыйАкцизНаТоварыВПути</name>
  </enumValues>
  <enumValues>
    <name>АкцизПоНеОплаченнымМЦ</name>
  </enumValues>
  <enumValues>
    <name>АкцизПоОплаченнымМЦ</name>
  </enumValues>
  <enumValues>
    <name>ЗарегистрированаБанковскаяГарантияЗаАкцизыВБюджет</name>
  </enumValues>
  <enumValues>
    <name>ОплаченАвансЗаАкцизыВБюджет</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_СостоянияПодакцизногоСырья/бг_СостоянияПодакцизногоСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_СостоянияПодакцизногоСырья</name>
  <enumValues>
    <name>ВМестахХранения</name>
  </enumValues>
  <enumValues>
    <name>ВГотовойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВСпиртосодержащейСмеси</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспорта</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантии</name>
  </enumValues>
  <enumValues>
    <name>ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВРеализованнойПродукцииЭкспортКромеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗПоНорме</name>
  </enumValues>
  <enumValues>
    <name>ВСписанныхМПЗСверхНормы</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортГарантии</name>
  </enumValues>
  <enumValues>
    <name>ПодтвержденЭкспортЕАЭСГарантии</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Documents/битОперацияУчетаАкциза/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СтатусыСостоянияСписываемогоСырья() Экспорт
	СтатусыСостояния = бг_УчетБанковскихГарантий.СтатусыСостоянияСписываемогоСырья();
	
	СтатусыСостояния.СтатусыАкциза.Добавить(Перечисления.бг_СостоянияОплатыВходящегоАкциза.АвансовыйАкцизВСырье);
	СтатусыСостояния.СтатусыАкциза.Добавить(Перечисления.бг_СостоянияОплатыВходящегоАкциза.АкцизПоОплаченнымМЦ);
	СтатусыСостояния.СтатусыАкциза.Добавить(Перечисления.бг_СостоянияОплатыВходящегоАкциза.АкцизПоНеОплаченнымМЦ);
	СтатусыСостояния.СтатусыАкциза.Добавить(Перечисления.бг_СостоянияОплатыВходящегоАкциза.АкцизПоВозвращеннойПродукции);
	
	СтатусыСостояния.СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспорта);
	СтатусыСостояния.СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантии);
	СтатусыСостояния.СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаГарантииЕАЭС);
	СтатусыСостояния.СостоянияСырья.Добавить(Перечисления.бг_СостоянияПодакцизногоСырья.ВОжиданииПодтвержденияЭкспортаЕАЭС);
	
	Возврат СтатусыСостояния;
КонецФункции

#КонецОбласти
